note = [
    "Имя пользователя",
    "Содержание заметки",
    "Статус",
    "Дата создания",
    "Дата изменения",
    ["Заголовок 1", "Заголовок 2", "Заголовок 3"] # вложенный список для заголовков
    ]

note[0] = input("Введите имя: ")
for i in range(3):
    note[5][i] = input("Введите заголовок заметки: ")
note[1] = input("Введите описание заметки: ")
note[2] = input("Введите статус заметки: ")
note[3] = input('Введите дату создания заметки в формате "день-месяц-год": ')
note[4] = input('Введите дата истечения заметки (дедлайн) в формате "день-месяц-год": ')

print(note)
print("Имя пользователя:", note[0])
print("Заголовоки заметок:", note[5])
print("Описание заметки:", note[1])
print("Статус заметки:", note[2])
print("Дата создания заметки:", note[3])
print("Дата истечения заметки:", note[4])
