note = {
    "Имя пользователя": "",
    "Содержание заметки": "",
    "Статус": "",
    "Дата создания": "",
    "Дата завершения": "",
    "Заголовки": ["", "", ""]
}

note["Имя пользователя"] = input("Введите имя: ")
for i in range(3):
    note["Заголовки"][i] = input("Введите заголовок заметки: ")
note["Содержание заметки"] = input("Введите описание заметки: ")
note["Статус"] = input("Введите статус заметки: ")
note["Дата создания"] = input('Введите дату создания заметки в формате "день-месяц-год": ')
note["Дата завершения"] = input('Введите дата истечения заметки (дедлайн) в формате "день-месяц-год": ')

print(note)
