username = 'Евгений'            # имя пользователя
title = 'Дедлайны'              # заголовок заметки
content = 'То что забыл'        # описание заметки
status = 'Выполняется'          # статус заметки
created_date = '12-01-2025'     # дата создания заметки в формате "день-месяц-год"
issue_date = '12-02-2025'       # дата истечения заметки (дедлайн) в формате "день-месяц-год"

print("Имя пользователя:", username)
print("Заголовок заметки:", title)
print("Описание заметки:", content)
print("Статус заметки:", status)
print("Дата создания заметки:", created_date)
print("Дата истечения заметки:", issue_date)
